# В городе планируют построить театр под открытым небом,
# но для начала нужно оценить,
# сколько сделать рядов, сидений в них
# и каким должно быть расстояние между рядами.

# Что нужно сделать

# Напишите программу,
# которая получает на вход количество рядов, сидений
# и свободных метров между рядами,
# а затем выводит примерный макет театра на экран.


# Сцена
# Введите кол-во рядов: 5
# Введите кол-во сидений ряду: 7
# Введите кол-во метров между рядами: 3
#
# ======= *** =======
# ======= *** =======
# ======= *** =======
# ======= *** =======
# ======= *** =======
rows = int(input('Введите кол-во рядов: '))
seats = int(input('Введите кол-во сидений ряду: '))
spacing = int(input('Введите кол-во метров между рядами: '))
# rows = 5
# seats = 7
# spacing = 3
row = '=' * seats + ' ' + '*' * spacing + ' ' + '=' * seats
for _ in range(rows):
    print(row)
