import numpy as np

a = np.array([(1, 2), (3, 4)])
a
b = np.array([(5, 6), (7, 8)])
b
np.hstack([a, b])
# array([[1, 2, 5, 6],
#        [3, 4, 7, 8]])
np.vstack([a, b])
# array([[1, 2],
#        [3, 4],
#        [5, 6],
#        [7, 8]])
np.vstack([b, a])
# array([[5, 6],
#        [7, 8],
#        [1, 2],
#        [3, 4]])
np.vstack([b, a, a])
# array([[5, 6],
#        [7, 8],
#        [1, 2],
#        [3, 4],
#        [1, 2],
#        [3, 4]])
a = np.fromiter(range(18), dtype='int32')
b = np.fromiter(range(18, 36), dtype='int32')
a.resize(3, 3, 2)
b.resize(3, 3, 2)
a
# array([[[ 0,  1],
#         [ 2,  3],
#         [ 4,  5]],
#        [[ 6,  7],
#         [ 8,  9],
#         [10, 11]],
#        [[12, 13],
#         [14, 15],
#         [16, 17]]])
b
# array([[[18, 19],
#         [20, 21],
#         [22, 23]],
#        [[24, 25],
#         [26, 27],
#         [28, 29]],
#        [[30, 31],
#         [32, 33],
#         [34, 35]]])
c = np.hstack([a, b])
c
# array([[[ 0,  1],
#         [ 2,  3],
#         [ 4,  5],
#         [18, 19],
#         [20, 21],
#         [22, 23]],
#        [[ 6,  7],
#         [ 8,  9],
#         [10, 11],
#         [24, 25],
#         [26, 27],
#         [28, 29]],
#        [[12, 13],
#         [14, 15],
#         [16, 17],
#         [30, 31],
#         [32, 33],
#         [34, 35]]])
c.shape
# (3, 6, 2)
d = np.vstack([a, b])
d.shape
# (6, 3, 2)
a = np.fromstring('1 2 3 4', sep=' ')
b = np.fromstring('5 6 7 8', sep=' ')
a
# array([1., 2., 3., 4.])
b
# array([5., 6., 7., 8.])
np.hstack([a, b])
# array([1., 2., 3., 4., 5., 6., 7., 8.])
np.vstack([a, b])
# array([[1., 2., 3., 4.],
#        [5., 6., 7., 8.]])
a
# array([1., 2., 3., 4.])
b
# array([5., 6., 7., 8.])
np.column_stack([a, b])
# array([[1., 5.],
#        [2., 6.],
#        [3., 7.],
#        [4., 8.]])
np.row_stack([a, b])
# array([[1., 2., 3., 4.],
#        [5., 6., 7., 8.]])


a = np.arange(1, 13)
b = np.arange(13, 26)
a.resize(3, 3, 2)
b.resize(3, 3, 2)
c0 = np.concatenate([a, b], axis=0)  # размерность 6х3х2
c1 = np.concatenate([a, b], axis=1)  # размерность 3х6х2
c2 = np.concatenate([a, b], axis=2)  # размерность 3х3х4
c0.shape
# (6, 3, 2)


np.r_[[1, 2, 3], 4, 5]
# array([1, 2, 3, 4, 5])
np.r_[1:9, 90, 100]
# array([  1,   2,   3,   4,   5,   6,   7,   8,  90, 100])
np.r_[np.array([1, 2, 3]), np.array([4, 5, 6])]
# array([1, 2, 3, 4, 5, 6])
np.r_[[(1, 2, 3), (4, 5, 6)], [(7, 8, 9)]]
# array([[1, 2, 3],
#        [4, 5, 6],
#        [7, 8, 9]])

np.c_[1:5]
# array([[1],
#        [2],
#        [3],
#        [4]])
np.r_[1:5]
# array([1, 2, 3, 4])
np.c_[[1, 2, 3], [4, 5, 6]]
# array([[1, 4],
#        [2, 5],
#        [3, 6]])
np.c_[[(1, 2, 3), (4, 5, 6)], [[7], [8]]]
# array([[1, 2, 3, 7],
#        [4, 5, 6, 8]])


a = np.arange(10)
a
# array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])
np.hsplit(a, 2)
# [array([0, 1, 2, 3, 4]), array([5, 6, 7, 8, 9])]
np.hsplit(a, 3)
# ValueError: array split does not result in an equal division
np.hsplit(a, 5)
# [array([0, 1]), array([2, 3]), array([4, 5]), array([6, 7]), array([8, 9])]
np.vsplit(a, 2)
# ValueError: vsplit only works on arrays of 2 or more dimensions
a.shape = 10, -1
a
# array([[0],
#        [1],
#        [2],
#        [3],
#        [4],
#        [5],
#        [6],
#        [7],
#        [8],
#        [9]])
np.vsplit(a, 2)
# [array([[0],
#         [1],
#         [2],
#         [3],
#         [4]]),
#  array([[5],
#         [6],
#         [7],
#         [8],
#         [9]])]
a = np.arange(12)
a.resize(2, 6)
a
# array([[ 0,  1,  2,  3,  4,  5],
#        [ 6,  7,  8,  9, 10, 11]])
np.hsplit(a, 2)
# [array([[0, 1, 2],
#         [6, 7, 8]]),
#  array([[ 3,  4,  5],
#         [ 9, 10, 11]])]
np.vsplit(a, 2)
# [array([[0, 1, 2, 3, 4, 5]]), array([[ 6,  7,  8,  9, 10, 11]])]

a = np.arange(18)
a.resize(3, 3, 2)
a
# array([[[ 0,  1],
#         [ 2,  3],
#         [ 4,  5]],
#        [[ 6,  7],
#         [ 8,  9],
#         [10, 11]],
#        [[12, 13],
#         [14, 15],
#         [16, 17]]])
np.array_split(a, 2, axis=2)
# [array([[[0],
#          [2],
#          [4]],
#
#         [[6],
#          [8],
#          [10]],
#
#         [[12],
#          [14],
#          [16]]]),
#  array([[[1],
#          [3],
#          [5]],
#
#         [[7],
#          [9],
#          [11]],
#
#         [[13],
#          [15],
#          [17]]])]
np.array_split(a, 2, axis=0)
# [array([[[0, 1],
#          [2, 3],
#          [4, 5]],
#
#         [[6, 7],
#          [8, 9],
#          [10, 11]]]),
#  array([[[12, 13],
#          [14, 15],
#          [16, 17]]])]
np.array_split(a, 2, axis=1)
# [array([[[0, 1],
#          [2, 3]],
#
#         [[6, 7],
#          [8, 9]],
#
#         [[12, 13],
#          [14, 15]]]),
#  array([[[4, 5]],
#
#         [[10, 11]],
#
#         [[16, 17]]])]
